Revit 2024 API
SchemaCommon.Description Property
 The property labeled "Description" common to all visual Asset types.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string Description { get; }
Visual Basic
Public Shared ReadOnly Property Description As String
	Get
Visual C++
public:
static property String^ Description {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyString".
See Also
SchemaCommon Class
Autodesk.Revit.DB.Visual Namespace